timdonnelly1992/c2000_test/CRD25DA12-FMC.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28003x" --part "F28003x_100PZ" --package "100PZ" --context "system" --product "C2000WARE@5.03.00.00"
 * @v2CliArgs --device "TMS320F280039" --package "100PZ" --context "system" --product "C2000WARE@5.03.00.00"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const asysctl          = scripting.addModule("/driverlib/asysctl.js");
const can              = scripting.addModule("/driverlib/can.js", {}, false);
const can1             = can.addInstance();
const cla              = scripting.addModule("/driverlib/cla.js", {}, false);
const cla1             = cla.addInstance();
const epwm             = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const epwm3            = epwm.addInstance();
const epwm4            = epwm.addInstance();
const epwmxbar         = scripting.addModule("/driverlib/epwmxbar.js", {}, false);
const epwmxbar1        = epwmxbar.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1            = gpio.addInstance();
const gpio2            = gpio.addInstance();
const gpio3            = gpio.addInstance();
const gpio4            = gpio.addInstance();
const gpio5            = gpio.addInstance();
const gpio6            = gpio.addInstance();
const gpio7            = gpio.addInstance();
const gpio8            = gpio.addInstance();
const gpio9            = gpio.addInstance();
const gpio10           = gpio.addInstance();
const gpio11           = gpio.addInstance();
const gpio12           = gpio.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const memcfg           = scripting.addModule("/driverlib/memcfg.js");
const sci              = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1             = sci.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                    = "myADC0";
adc1.enableInterrupt1         = true;
adc1.adcClockPrescaler        = "ADC_CLK_DIV_2_0";
adc1.soc1SampleWindow         = 15;
adc1.soc2SampleWindow         = 15;
adc1.soc3SampleWindow         = 15;
adc1.soc4Channel              = "ADC_CH_ADCIN1";
adc1.soc4SampleWindow         = 15;
adc1.soc5Name                 = "VW_MEAS";
adc1.soc5Channel              = "ADC_CH_ADCIN4";
adc1.soc5SampleWindow         = 15;
adc1.soc6Name                 = "VDC_MEAS";
adc1.soc6Channel              = "ADC_CH_ADCIN5";
adc1.soc6SampleWindow         = 15;
adc1.ppb1Name                 = "IU_PPB";
adc1.ppb2IndependentNameMode  = true;
adc1.ppb3IndependentNameMode  = true;
adc1.interrupt2SOCSource      = "ADC_SOC_NUMBER2";
adc1.ppb1IndependentNameMode  = true;
adc1.ppb2Name                 = "IU_PPB";
adc1.ppb3Name                 = "IV_PPB";
adc1.ppb4Name                 = "IW_PPB";
adc1.ppb4SOCNumber            = "ADC_SOC_NUMBER2";
adc1.ppb3SOCNumber            = "ADC_SOC_NUMBER1";
adc1.ppb4IndependentNameMode  = true;
adc1.ppb2EventInterruptEnable = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc1.ppb2HighTripLimit        = 4095;
adc1.interruptPulseMode       = "ADC_PULSE_END_OF_CONV";
adc1.ppb2EventEnable          = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc1.registerInterrupts       = ["5"];
adc1.useInterrupts            = false;
adc1.soc9SampleWindow         = 15;
adc1.soc9Name                 = "SPARE_ADC1";
adc1.soc9Channel              = "ADC_CH_ADCIN14";
adc1.ppb3EventEnable          = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc1.ppb3EventInterruptEnable = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc1.ppb3HighTripLimit        = 4095;
adc1.ppb4HighTripLimit        = 4095;
adc1.ppb4EventEnable          = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc1.ppb4EventInterruptEnable = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc1.soc0Name                 = "SIN";
adc1.soc0Channel              = "ADC_CH_ADCIN8";
adc1.soc1Name                 = "COS";
adc1.soc1Channel              = "ADC_CH_ADCIN9";
adc1.interrupt1SOCSource      = "ADC_SOC_NUMBER1";
adc1.soc2Name                 = "NTC";
adc1.soc2Channel              = "ADC_CH_ADCIN14";
adc1.enableInterrupt2         = true;
adc1.enabledSOCs              = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4"];
adc1.soc3Name                 = "SPARE_ADC1";
adc1.soc4Name                 = "SPARE_ADC2";
adc1.enabledInts              = ["ADC_INT_NUMBER1","ADC_INT_NUMBER2","ADC_INT_NUMBER3"];
adc1.interrupt3SOCSource      = "ADC_SOC_NUMBER4";
adc1.enableInterrupt3         = true;
adc1.soc0SampleWindow         = 15;

adc2.$name                   = "myADC1";
adc2.enableInterrupt1        = true;
adc2.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc2.soc0SampleWindow        = 15;
adc2.soc1SampleWindow        = 15;
adc2.soc2SampleWindow        = 15;
adc2.soc3SampleWindow        = 15;
adc2.soc4SampleWindow        = 15;
adc2.soc5SampleWindow        = 15;
adc2.soc6Name                = "VDC_MEAS";
adc2.soc6Channel             = "ADC_CH_ADCIN5";
adc2.soc6SampleWindow        = 15;
adc2.ppb1Name                = "IU_PPB";
adc2.ppb2IndependentNameMode = true;
adc2.ppb3IndependentNameMode = true;
adc2.ppb1IndependentNameMode = true;
adc2.enabledPPBs             = ["ADC_PPB_NUMBER2","ADC_PPB_NUMBER3","ADC_PPB_NUMBER4"];
adc2.ppb4IndependentNameMode = true;
adc2.ppb2HighTripLimit       = 4095;
adc2.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc2.registerInterrupts      = ["5"];
adc2.useInterrupts           = false;
adc2.soc9SampleWindow        = 15;
adc2.soc9Name                = "SPARE_ADC1";
adc2.soc9Channel             = "ADC_CH_ADCIN14";
adc2.ppb3HighTripLimit       = 4095;
adc2.ppb4HighTripLimit       = 4095;
adc2.adcBase                 = "ADCB_BASE";
adc2.soc1Name                = "VU_MEAS";
adc2.soc2Name                = "VV_MEAS";
adc2.soc0Name                = "VDC_MEAS";
adc2.soc0Channel             = "ADC_CH_ADCIN10";
adc2.soc1Channel             = "ADC_CH_ADCIN6";
adc2.soc2Channel             = "ADC_CH_ADCIN8";
adc2.soc3Name                = "VW_MEAS";
adc2.soc3Channel             = "ADC_CH_ADCIN1";
adc2.soc4Name                = "T_AMB";
adc2.interrupt1SOCSource     = "ADC_SOC_NUMBER3";
adc2.ppb2Name                = "VU_PPB";
adc2.ppb2SOCNumber           = "ADC_SOC_NUMBER1";
adc2.ppb3Name                = "VV_PPB";
adc2.ppb4Name                = "VW_PPB";
adc2.ppb4SOCNumber           = "ADC_SOC_NUMBER3";
adc2.ppb3SOCNumber           = "ADC_SOC_NUMBER2";
adc2.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc2.soc5Name                = "AMBIENT_TEMP";
adc2.enabledInts             = ["ADC_INT_NUMBER1","ADC_INT_NUMBER2","ADC_INT_NUMBER3"];
adc2.enableInterrupt2        = true;
adc2.enableInterrupt3        = true;
adc2.interrupt3SOCSource     = "ADC_SOC_NUMBER5";

adc3.$name                    = "myADC2";
adc3.soc0Name                 = "IU_MEAS";
adc3.enableInterrupt1         = true;
adc3.adcClockPrescaler        = "ADC_CLK_DIV_2_0";
adc3.soc0SampleWindow         = 15;
adc3.soc1Name                 = "IV_MEAS";
adc3.soc1SampleWindow         = 15;
adc3.soc2SampleWindow         = 15;
adc3.soc2Name                 = "IW_MEAS";
adc3.soc3Name                 = "VU_MEAS";
adc3.soc3SampleWindow         = 15;
adc3.soc4Name                 = "VV_MEAS";
adc3.soc4Channel              = "ADC_CH_ADCIN1";
adc3.soc4SampleWindow         = 15;
adc3.soc5Name                 = "VW_MEAS";
adc3.soc5Channel              = "ADC_CH_ADCIN4";
adc3.soc5SampleWindow         = 15;
adc3.soc6Name                 = "VDC_MEAS";
adc3.soc6Channel              = "ADC_CH_ADCIN5";
adc3.soc6SampleWindow         = 15;
adc3.ppb1Name                 = "IU_PPB";
adc3.ppb2IndependentNameMode  = true;
adc3.ppb3IndependentNameMode  = true;
adc3.interrupt2SOCSource      = "ADC_SOC_NUMBER2";
adc3.ppb1IndependentNameMode  = true;
adc3.enabledPPBs              = ["ADC_PPB_NUMBER2","ADC_PPB_NUMBER3","ADC_PPB_NUMBER4"];
adc3.ppb2Name                 = "IU_PPB";
adc3.ppb3Name                 = "IV_PPB";
adc3.ppb4Name                 = "IW_PPB";
adc3.ppb4SOCNumber            = "ADC_SOC_NUMBER2";
adc3.ppb3SOCNumber            = "ADC_SOC_NUMBER1";
adc3.ppb4IndependentNameMode  = true;
adc3.ppb2EventInterruptEnable = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc3.ppb2HighTripLimit        = 4095;
adc3.enabledInts              = ["ADC_INT_NUMBER1"];
adc3.interruptPulseMode       = "ADC_PULSE_END_OF_CONV";
adc3.ppb2EventEnable          = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc3.registerInterrupts       = ["5"];
adc3.useInterrupts            = false;
adc3.soc9SampleWindow         = 15;
adc3.soc9Name                 = "SPARE_ADC1";
adc3.soc9Channel              = "ADC_CH_ADCIN14";
adc3.ppb3EventEnable          = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc3.ppb3EventInterruptEnable = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc3.ppb3HighTripLimit        = 4095;
adc3.ppb4HighTripLimit        = 4095;
adc3.ppb4EventEnable          = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc3.ppb4EventInterruptEnable = ["ADC_EVT_TRIPHI","ADC_EVT_TRIPLO"];
adc3.adcBase                  = "ADCC_BASE";
adc3.soc0Channel              = "ADC_CH_ADCIN3";
adc3.enabledSOCs              = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc3.soc1Channel              = "ADC_CH_ADCIN5";
adc3.soc2Channel              = "ADC_CH_ADCIN7";
adc3.interrupt1SOCSource      = "ADC_SOC_NUMBER2";

const analog  = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1 = analog.addInstance({}, false);
analog1.$name = "myANALOGPinMux0";
adc1.analog   = analog1;
adc2.analog   = analog1;
adc3.analog   = analog1;

asysctl.analogReference        = "INTERNAL";
asysctl.analogReferenceVoltage = "1P65";

