timdonnelly1992/c2000_test/CRD25DA12-FMC.syscfg
epwm4.epwmTimebase_hsClockDiv                                       = "EPWM_HSCLOCK_DIVIDER_1";
epwm4.epwmTimebase_counterMode                                      = "EPWM_COUNTER_MODE_UP_DOWN";
epwm4.epwmTimebase_syncOutPulseMode                                 = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA      = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA    = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmDeadband_polarityFED                                      = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm4.epwmDeadband_enableRED                                        = true;
epwm4.epwmDeadband_enableFED                                        = true;
epwm4.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                     = "EPWM_TZ_ACTION_LOW";
epwm4.epwmTripZone_oneShotSource                                    = ["EPWM_TZ_SIGNAL_DCAEVT1"];
epwm4.epwmTripZone_tzInterruptSource                                = ["EPWM_TZ_INTERRUPT_DCAEVT1"];
epwm4.epwmDigitalCompare_EPWM_DC_TYPE_DCAH                          = "EPWM_DC_TRIP_TRIPIN4";
epwm4.epwmDigitalCompare_EPWM_DC_TYPE_DCAL                          = "EPWM_DC_TRIP_TRIPIN4";
epwm4.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_A1                       = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm4.epwmDigitalCompare_EPWM_DC_MODULE_A_EPWM_DC_EVENT_1_eventSync = "EPWM_DC_EVENT_INPUT_NOT_SYNCED";
epwm4.$name                                                         = "myEPWM7";
epwm4.epwm.$assign                                                  = "EPWM7";
epwm4.epwm.epwm_aPin.$assign                                        = "GPIO12";
epwm4.epwm.epwm_bPin.$assign                                        = "GPIO13";

epwmxbar1.$name           = "myEPWMXBAR0";
epwmxbar1.useSourceSelect = true;
epwmxbar1.sourceSignals   = ["ADCAEVT2","ADCAEVT3","ADCAEVT4"];

gpio1.$name             = "LED_RED_PIN";
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.qualMode          = "GPIO_QUAL_ASYNC";
gpio1.writeInitialValue = true;
gpio1.gpioPin.$assign   = "GPIO58";

gpio2.$name             = "LED_GREEN_PIN";
gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.qualMode          = "GPIO_QUAL_ASYNC";
gpio2.writeInitialValue = true;
gpio2.gpioPin.$assign   = "GPIO60";

gpio3.$name           = "LED_YELLOW_PIN";
gpio3.qualMode        = "GPIO_QUAL_ASYNC";
gpio3.direction       = "GPIO_DIR_MODE_OUT";
gpio3.gpioPin.$assign = "GPIO59";

gpio4.$name             = "LED_CONTROLCARD1";
gpio4.direction         = "GPIO_DIR_MODE_OUT";
gpio4.writeInitialValue = true;
gpio4.initialValue      = 1;
gpio4.qualMode          = "GPIO_QUAL_ASYNC";
gpio4.gpioPin.$assign   = "GPIO31";

gpio5.$name             = "LED_CONTROLCARD2";
gpio5.direction         = "GPIO_DIR_MODE_OUT";
gpio5.qualMode          = "GPIO_QUAL_ASYNC";
gpio5.writeInitialValue = true;
gpio5.initialValue      = 1;
gpio5.gpioPin.$assign   = "GPIO34";

gpio6.$name             = "GATEDRIVE_DISABLE";
gpio6.direction         = "GPIO_DIR_MODE_OUT";
gpio6.qualMode          = "GPIO_QUAL_ASYNC";
gpio6.writeInitialValue = true;
gpio6.initialValue      = 1;
gpio6.gpioPin.$assign   = "GPIO23";

gpio7.$name             = "RELAY1_OUT";
gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.qualMode          = "GPIO_QUAL_ASYNC";
gpio7.writeInitialValue = true;
gpio7.gpioPin.$assign   = "GPIO44";

gpio8.$name             = "RELAY2_OUT";
gpio8.direction         = "GPIO_DIR_MODE_OUT";
gpio8.qualMode          = "GPIO_QUAL_ASYNC";
gpio8.writeInitialValue = true;
gpio8.gpioPin.$assign   = "GPIO61";

gpio9.$name           = "SPARE_GPIO_INPUT1";
gpio9.padConfig       = "PULLUP";
gpio9.qualMode        = "GPIO_QUAL_ASYNC";
gpio9.gpioPin.$assign = "GPIO35/TDI";

gpio10.$name           = "SPARE_GPIO_INPUT2";
gpio10.padConfig       = "PULLUP";
gpio10.qualMode        = "GPIO_QUAL_ASYNC";
gpio10.gpioPin.$assign = "GPIO54";

gpio11.$name             = "SPARE_GPIO_OUTPUT1";
gpio11.direction         = "GPIO_DIR_MODE_OUT";
gpio11.qualMode          = "GPIO_QUAL_ASYNC";
gpio11.writeInitialValue = true;
gpio11.gpioPin.$assign   = "GPIO55";

gpio12.$name             = "SPARE_GPIO_OUTPUT2";
gpio12.direction         = "GPIO_DIR_MODE_OUT";
gpio12.qualMode          = "GPIO_QUAL_ASYNC";
gpio12.writeInitialValue = true;
gpio12.gpioPin.$assign   = "GPIO57";

inputxbar_input1.$name          = "myINPUTXBARINPUT0";
inputxbar_input1.inputxbarInput = "XBAR_INPUT7";
inputxbar_input1.inputxbarGpio  = "GPIO8";

memcfg.init_MEMCFG_SECT_MSGCPUTOCLA1 = true;
memcfg.config_MEMCFG_SECT_LS0        = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS1        = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS2        = "CLA_data";
memcfg.config_MEMCFG_SECT_LS3        = "CLA_data";
memcfg.init_MEMCFG_SECT_MSGCLA1TOCPU = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
analog1.analog.$suggestSolution                           = "ANALOG";
analog1.analog["a0/b15/c15/daca_outPin"].$suggestSolution = "A0/B15/C15/DACA_OUT";
analog1.analog["a1/b7/dacb_outPin"].$suggestSolution      = "A1/B7/DACB_OUT";
analog1.analog["a10/b1/c10Pin"].$suggestSolution          = "A10/B1/C10";
analog1.analog["a11/b10/c0Pin"].$suggestSolution          = "A11/B10/C0";
analog1.analog["a12, c5Pin"].$suggestSolution             = "A12, C5";
analog1.analog["a14/b14/c4Pin"].$suggestSolution          = "A14/B14/C4";
analog1.analog["a2/b6/c9Pin"].$suggestSolution            = "A2/B6/C9";
analog1.analog["a3, c7/b9Pin"].$suggestSolution           = "A3, C7/B9";
analog1.analog["a4/b8Pin"].$suggestSolution               = "A4/B8";
analog1.analog.a5Pin.$suggestSolution                     = "A5";
analog1.analog.a6Pin.$suggestSolution                     = "A6";
analog1.analog.a8Pin.$suggestSolution                     = "A8";
analog1.analog.a9Pin.$suggestSolution                     = "A9";
analog1.analog["b0/c11Pin"].$suggestSolution              = "B0/C11";
analog1.analog.b11Pin.$suggestSolution                    = "B11";
analog1.analog["b11, gpio21Pin"].$suggestSolution         = "B11, GPIO21";
analog1.analog["b2/c6Pin"].$suggestSolution               = "B2/C6";
analog1.analog["b3/vdacPin"].$suggestSolution             = "B3/VDAC";
analog1.analog["b4/c8Pin"].$suggestSolution               = "B4/C8";
analog1.analog.b5Pin.$suggestSolution                     = "B5";
analog1.analog["b5, gpio20Pin"].$suggestSolution          = "B5, GPIO20";
analog1.analog.c1Pin.$suggestSolution                     = "C1";
analog1.analog.c14Pin.$suggestSolution                    = "C14";
analog1.analog["c2/b12Pin"].$suggestSolution              = "C2/B12";
analog1.analog["c3/a7Pin"].$suggestSolution               = "C3/A7";
